{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.17.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_2_1/conv1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv1_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_1_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_1_bn_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_1_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_1_1/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_1_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pad_2_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_2_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_2_bn_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_2_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_2_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_2_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_3_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_3_bn_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_3_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_3_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_3_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pad_4_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_4_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_4_bn_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_4_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_4_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_4_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_5_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_5_bn_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_5_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_5_1/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_5_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pad_6_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_6_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_6_bn_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_6_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_6_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_6_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_7_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_7_bn_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_7_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_7_1/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_7_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_8_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_8_bn_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_8_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_8_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_8_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_9_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_9_bn_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_9_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_9_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_9_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_10_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_10_bn_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_10_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_10_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_10_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_11_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_11_bn_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_11_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_11_1/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_11_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pad_12_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_12_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_12_bn_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_12_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_12_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_12_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_13_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_13_bn_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_13_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_13_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_13_bn_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_2_1/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_1_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv1_relu_1/Relu6", "op": "_FusedConv2D", "input": ["inputs", "StatefulPartitionedCall/functional_2_1/conv1_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv1_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_1_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv1_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_dw_1_1/depthwise/ReadVariableOp"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_1_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_1_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_1_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_1_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_1_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_1_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_1_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_1_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_1_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_1_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_1_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_1_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pad_2_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_1_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pad_2_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_2_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pad_2_1/Pad", "StatefulPartitionedCall/functional_2_1/conv_dw_2_1/depthwise/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_2_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_2_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_2_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_2_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_2_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_2_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_2_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_2_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_2_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_2_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_2_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_2_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_3_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_2_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_dw_3_1/depthwise/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_3_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_3_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_3_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_3_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_3_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_3_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_3_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_3_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_3_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_3_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_3_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_3_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pad_4_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_3_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pad_4_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_4_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pad_4_1/Pad", "StatefulPartitionedCall/functional_2_1/conv_dw_4_1/depthwise/ReadVariableOp"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_4_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_4_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_4_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_4_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_4_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_4_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_4_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_4_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_4_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_4_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_4_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_4_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_5_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_4_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_dw_5_1/depthwise/ReadVariableOp"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_5_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_5_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_5_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_5_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_5_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_5_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_5_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_5_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_5_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_5_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_5_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_5_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pad_6_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_5_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pad_6_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_6_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pad_6_1/Pad", "StatefulPartitionedCall/functional_2_1/conv_dw_6_1/depthwise/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_6_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_6_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_6_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_6_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_6_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_6_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_6_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_6_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_6_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_6_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_6_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_6_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_7_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_6_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_dw_7_1/depthwise/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_7_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_7_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_7_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_7_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_7_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_7_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_7_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_7_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_7_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_7_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_7_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_7_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_8_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_7_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_dw_8_1/depthwise/ReadVariableOp"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_8_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_8_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_8_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_8_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_8_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_8_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_8_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_8_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_8_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_8_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_8_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_8_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_9_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_8_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_dw_9_1/depthwise/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_9_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_9_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_9_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_9_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_9_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_9_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_9_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_9_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_9_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_9_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_9_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_9_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_10_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_9_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_dw_10_1/depthwise/ReadVariableOp"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_10_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_10_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_10_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_10_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_10_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_10_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_10_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_10_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_10_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_10_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_10_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_10_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_11_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_10_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_dw_11_1/depthwise/ReadVariableOp"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_11_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_11_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_11_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_11_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_11_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_11_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_11_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_11_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_11_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_11_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_11_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_11_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pad_12_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_11_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pad_12_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_12_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pad_12_1/Pad", "StatefulPartitionedCall/functional_2_1/conv_dw_12_1/depthwise/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_12_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_12_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_12_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_12_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_12_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_12_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_12_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_12_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_12_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_12_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_12_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_12_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_13_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_12_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_dw_13_1/depthwise/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_13_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_13_1/depthwise", "StatefulPartitionedCall/functional_2_1/conv_dw_13_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_13_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_13_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/conv_dw_13_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_dw_13_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_13_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv_pw_13_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_2_1/conv_dw_13_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/conv_pw_13_1/convolution/merged_input", "StatefulPartitionedCall/functional_2_1/conv_pw_13_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_2_1/conv_pw_13_relu_1/Relu6", "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_2_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1/Mean", "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_2_1/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_1_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_2_1/global_average_pooling2d_2_1/Mean", "StatefulPartitionedCall/functional_2_1/dense_1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_2_1/dense_1_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, 